let им = {n: "The air purifies", n1:'', n2:'the trees'};
let родит = { n: "I'll have a glass", n1:'of',n2:'juice' };
let дат = { n: "You'll bring the book", n1: 'to', n2:'the librarian' };
let винит = {n: "I want to write a new", n1:'', n2:'story'};
let твор = { n: "This cupcake was baked", n1:'by',n2:'my mother' };
let предл = { n: "I watch a movie", n1: 'about', n2:'animals' };

let arr1 = [ им, родит, дат,винит, твор, предл ];


var arr2=[
'Деревья очищают воздух',
'Я выпью стакан сока',
'Ты принесешь книгу библиотекарю',
'Я хочу написать новый рассказ',
'Этот кекс был испечен моей матерью',
'Я смотрю фильм о животных'
];
var arr3=[
'Именительный отвечает на вопрос (кто, что?).</br> Употребляется без предлога.',
'Родительный отвечает на вопрос (кого, чего?).</br> Употребляется c предлогом of.',
'Дательный отвечает на вопрос (кому, чему?).</br> Употребляется с предлогом to,for.',
'Винительный отвечает на вопрос (кого, что?).</br> Употребляется без предлога.',
'Творительный отвечает на вопрос (кем, чем?).</br> Употребляется с предлогом by, with.',
'Предложный отвечает на вопрос (о ком?, о чем?).</br> Употребляется с предлогами about, of, on.'
];
var arr4=[
'именительном падеже',
'родительном падеже',
'дательном падеже',
'винительном падеже',
'творительном падеже',
'предложном падеже'
];